* Example


#+TBLNAME: example
| A                       | B                  | C [fn:example1] | D [fn:example4] |
|-------------------------+--------------------+-----------------+-----------------|
| 230498.10 [fn:example2] | 0.06 [fn:example3] |       230498.16 |            0.24 |
| 1203948501              | .08                |   1203948501.08 |            0.28 |
#+TBLFM: $3=$2+$1::$4=sqrt($2)::@2$1=.10+230498::@2$2=2/35


Another Table:

#+TBLNAME: REVFORECAST
|   | Year | Sales                                    | COGS                                     | Gross Margin [fn:REVFORECAST1] |
|---+------+------------------------------------------+------------------------------------------+--------------------------------|
|   | 2012 | 1.04                                     | .75                                      |                           0.29 |
|   | 2013 | 1.06                                     | .80                                      |                           0.26 |
|   | 2014 | 1.08                                     | 0.85                                     |                           0.23 |
|   | 2015 | 1.10 [fn:REVFORECAST2]                   | 0.91 [fn:REVFORECAST2]                   |                           0.19 |
|   | 2016 | 1.12 [fn:REVFORECAST2]                   | 0.97 [fn:REVFORECAST2]                   |                           0.15 |
|   | 2017 | 1.14 [fn:REVFORECAST2]                   | 1.03 [fn:REVFORECAST2]                   |                           0.11 |
|   | 2018 | 1.16 [fn:REVFORECAST2]                   | 1.10 [fn:REVFORECAST2]                   |                           0.06 |
|   | 2019 | 1.18 [fn:REVFORECAST2]                   | 1.17 [fn:REVFORECAST2]                   |                           0.01 |
|   | 2020 | 1.20 [fn:REVFORECAST2] [fn:REVFORECAST2] | 1.24 [fn:REVFORECAST2] [fn:REVFORECAST2] |                          -0.05 |
#+TBLFM: $5=$Sales-$COGS::@5$3=@-1*(1+(@4-@3)/@3)::@5$4=@-1*(1+(@4-@3)/@3)::@6$3=@-1*(1+(@4-@3)/@3)::@6$4=@-1*(1+(@4-@3)/@3)::@7$3=@-1*(1+(@4-@3)/@3)::@7$4=@-1*(1+(@4-@3)/@3)::@8$3=@-1*(1+(@4-@3)/@3)::@8$4=@-1*(1+(@4-@3)/@3)::@9$3=@-1*(1+(@4-@3)/@3)::@9$4=@-1*(1+(@4-@3)/@3)::@10$3=@-1*(1+(@4-@3)/@3)::@10$4=@-1*(1+(@4-@3)/@3)::@12$3=@-1*(1+(@4-@3)/@3)::@12$4=@-1*(1+(@4-@3)/@3)

* Footnotes
[fn:example1] \$2+\$1

[fn:example2] .10+230498

[fn:example3] 2/35

[fn:example4] sqrt(\$2)

[fn:REVFORECAST1] \$Sales-\$COGS

[fn:REVFORECAST2] @-1*(1+(@4-@3)/@3)




